<a href="https://colab.research.google.com/github/dkchebet7/sampling-and-hypothesis-testing/blob/master/Daisy_Chebet(week3_IP).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Reasearch Question

#### To determine the proportion of blue cars that were recharged over the weekend

## Metrics For Success

##### 1) Choose an appropriate sampling technique
##### 2) Understand attributes of the data to and use effective methods for insightful findings

## Context

## Experimental Designs

## Appropriateness of Data

In [0]:
### Importing necessary libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [13]:
## Loading dataset

cars = pd.read_csv('http://bit.ly/DSCoreAutolibDataset')

## Viewing the first 5 rows of our dataset

cars.head()

   Postal code      date  ...  Slots_freed_sum  Slots_taken_sum
0        75001  1/1/2018  ...               22               20
1        75001  1/2/2018  ...               23               22
2        75001  1/3/2018  ...               27               27
3        75001  1/4/2018  ...               25               21
4        75001  1/5/2018  ...               18               20

[5 rows x 13 columns]

In [10]:
## Loading data dictionary

dictionary = pd.read_excel('columns_explanation (1).xlsx')

## Viewing the dataset

dictionary

               Column name                                        explanation
0              Postal code                 postal code of the area (in Paris)
1                     date                        date of the row aggregation
2      n_daily_data_points  number of daily data poinst that were availabl...
3                dayOfWeek     identifier of weekday (0: Monday -> 6: Sunday)
4                 day_type                                 weekday or weekend
5       BlueCars_taken_sum    Number of bluecars taken that date in that area
6    BlueCars_returned_sum  Number of bluecars returned that date in that ...
7         Utilib_taken_sum      Number of Utilib taken that date in that area
8      Utilib_returned_sum   Number of Utilib returned that date in that area
9      Utilib_14_taken_sum  Number of Utilib 1.4 taken that date in that area
10  Utilib_14_returned_sum  Number of Utilib 1.4 returned that date in tha...
11         Slots_freed_sum  Number of recharging slots released that date ...
12         Slots_taken_sum  Number of rechargign slots taken that date in ...

# Tidying up dataset

In [17]:
### Creating a copy of the original dataset that we will work on withiut altering the original dataset

caars = cars.copy()

## Viewing the copy of the dataset
caars.head()

   postal_code      date  ...  slots_freed_sum  slots_taken_sum
0        75001  1/1/2018  ...               22               20
1        75001  1/2/2018  ...               23               22
2        75001  1/3/2018  ...               27               27
3        75001  1/4/2018  ...               25               21
4        75001  1/5/2018  ...               18               20

[5 rows x 13 columns]

#### Renaming columns

In [0]:
## Changing columns to lower case and replacing empty spaces with underscore columns
cars.columns = cars.columns.str.lower().str.replace(" ",'_')

In [18]:
cars.columns

Index(['postal_code', 'date', 'n_daily_data_points', 'dayofweek', 'day_type',
       'bluecars_taken_sum', 'bluecars_returned_sum', 'utilib_taken_sum',
       'utilib_returned_sum', 'utilib_14_taken_sum', 'utilib_14_returned_sum',
       'slots_freed_sum', 'slots_taken_sum'],
      dtype='object')

All empty spaces between column names have been replaced with an underscore

In [0]:
## Renaming colums

cars.rename(columns = {'n_daily_data_points': 'daily_data_poits','dayofweek':'day_of_the_week'},inplace = True)

#### Checking for null values

In [21]:
cars.isnull().sum()

postal_code               0
date                      0
n_daily_data_points       0
dayofweek                 0
day_type                  0
bluecars_taken_sum        0
bluecars_returned_sum     0
utilib_taken_sum          0
utilib_returned_sum       0
utilib_14_taken_sum       0
utilib_14_returned_sum    0
slots_freed_sum           0
slots_taken_sum           0
dtype: int64

There are no null values in the dataset

#### Checking